Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_CShapeProfile Properties
The IFC2X3_ParametricObject_CShapeProfile type exposes the following members.
Properties
Name | Description
Depth
 The depth.
Description
 The description of the product.
 (Inherited from ReferenceModelObjectAttribute.)
Extrusion
 The extrusion vector.
 (Inherited from ReferenceModelObjectAttribute.)
Girth
 The girth.
InternalFilletRadius
 The internal fillet radius.
Name
 The name of the product.
 (Inherited from ReferenceModelObjectAttribute.)
ObjectType
 The object type of the product.
 (Inherited from ReferenceModelObjectAttribute.)
Origin
 The origin of the extrusion.
 (Inherited from ReferenceModelObjectAttribute.)
ProfileName
 The name of the profile (often empty).
 (Inherited from ReferenceModelObjectAttribute.)
WallThickness
 The wall thickness.
Width
 The width.
xDir
 The X-axis direction.
 (Inherited from ReferenceModelObjectAttribute.)
Top
See Also
Reference
IFC2X3_ParametricObject_CShapeProfile Class
Tekla.Structures.Model.Collaboration Namespace